app/views/poll_accesses/create.html.haml

    %div.col-sm-10
      %p #{@poll.questions.count}
  .form-group
    .col-sm-offset-2.col-sm-10
---
SELECT COUNT(*) FROM "poll_questions" WHERE "poll_questions"."poll_id" = $1  [["poll_id", 1]]