app/controllers/answers_controller.rb

	def create
		@answer = @question.answers.new(answer_params)
		if @answer.save
---
INSERT INTO "poll_question_answers" ("answer", "created_at", "updated_at", "question_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["answer", "I'm rich"], ["created_at", "2017-07-19 13:54:12.375296"], ["updated_at", "2017-07-19 13:54:12.375296"], ["question_id", 3]]

	def index
		@answers = PollQuestionAnswer.where(question: params[:question_id])
---
SELECT "poll_question_answers".* FROM "poll_question_answers" WHERE "poll_question_answers"."question_id" = 3

	def set_poll
		@poll = Poll.find(params[:poll_id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]

	def set_question
		@question = PollQuestion.find(params[:question_id])
---
SELECT  "poll_questions".* FROM "poll_questions" WHERE "poll_questions"."id" = $1 ORDER BY "poll_questions"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]