app/controllers/polls_controller.rb

  def index
    if current_user.nil?
      redirect_to login_path
    else
      @current_user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @poll = Poll.new(poll_params)
    @poll.author = current_user

    if @poll.save
---
INSERT INTO "polls" ("title", "created_at", "updated_at", "author_id", "key") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Hehe"], ["created_at", "2017-07-19 14:43:48.781835"], ["updated_at", "2017-07-19 14:43:48.781835"], ["author_id", 8], ["key", "56fb9802f2d754c23784768ffc808d7f43a5d210"]]

  def update
    if @poll.update(poll_params)
---
UPDATE "polls" SET "title" = $1, "updated_at" = $2 WHERE "polls"."id" = $3  [["title", "Test"], ["updated_at", "2017-07-19 12:24:37.055825"], ["id", 4]]

    def set_poll
      @poll = Poll.find(params[:id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["id", 4], ["LIMIT", 1]]