app/controllers/poll_accesses_controller.rb

	def create
		@poll = Poll.where(key: session[:key]).first
		if session[:user_id].nil?
			redirect_to login_path
		elsif session[:key].nil? or @poll.nil?
			render inline: "<h1>Bad request</h1>", :status => 400
		else
			PollAccess.create(poll: @poll, user: current_user)
---
SELECT  "polls".* FROM "polls" WHERE "polls"."key" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["key", "009d92635b1e81d1648e4a6ca67f6571f9eab727"], ["LIMIT", 1]]
INSERT INTO "poll_accesses" ("created_at", "updated_at", "poll_id", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2017-07-19 16:45:23.979856"], ["updated_at", "2017-07-19 16:45:23.979856"], ["poll_id", 1], ["user_id", 2]]

	def check
		@poll = Poll.where(key: params[:key]).first
---
SELECT  "polls".* FROM "polls" WHERE "polls"."key" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["key", "56fb9802f2d754c23784768ffc808d7f43a5d210"], ["LIMIT", 1]]