app/controllers/questions_controller.rb

  def create
    @question = PollQuestion.new(question_params)
    @question.poll = @poll
    if @question.save
---
INSERT INTO "poll_questions" ("question", "created_at", "updated_at", "poll_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["question", "Why are you so happy?"], ["created_at", "2017-07-19 13:06:36.429194"], ["updated_at", "2017-07-19 13:06:36.429194"], ["poll_id", 4]]

    def set_poll
      @poll = Poll.find(params[:poll_id])
---
SELECT  "polls".* FROM "polls" WHERE "polls"."poll" = $1 ORDER BY "polls"."id" ASC LIMIT $2  [["poll", "4"], ["LIMIT", 1]]