app/controllers/results_controller.rb

SELECT  "poll_questions".* FROM "poll_questions" WHERE "poll_questions"."poll_id" = $1 ORDER BY "poll_questions"."id" ASC LIMIT $2  [["poll_id", 1], ["LIMIT", 1]]
SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def new
      @poll_results = []
      @temp_questions = []
      @temp_answers = []
      @poll_questions = PollQuestion.select("poll_questions.poll_id,
        poll_questions.id,
        poll_questions.question,
        poll_question_answers.id as answer_id,
        poll_question_answers.answer")
      .joins("INNER JOIN poll_question_answers
        on poll_questions.id = poll_question_answers.question_id")
      .where(poll_id: @poll.id)
      answers = []

      @poll_questions.each do |quan|

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "poll_questions".* FROM "poll_questions" WHERE "poll_questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "poll_question_answers".* FROM "poll_question_answers" WHERE "poll_question_answers"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "poll_results" ("created_at", "updated_at", "poll_id", "user_id", "question_id", "answer_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", "2017-07-19 20:53:29.614612"], ["updated_at", "2017-07-19 20:53:29.614612"], ["poll_id", 1], ["user_id", 2], ["question_id", 2], ["answer_id", 5]]
---
  def create
    #@poll = Poll.find(params[:poll].keys.first)
    poll_id = params[:poll].keys.first
    @poll = Poll.find(poll_id.to_i)
    params[:poll][poll_id]["answers"].each {|key, value|
      @question = PollQuestion.find(key)
      @answer = PollQuestionAnswer.find(value)
      PollResult.create(poll: @poll, user: current_user, question: @question, answer: @answer)

SELECT  "polls".* FROM "polls" WHERE "polls"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_poll
    @poll = Poll.find(params[:poll_id])