app/controllers/sessions_controller.rb

  def create
  	if user = User.find_by(email: params[:email]).try(:authenticate, params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "curse@bk.ru"], ["LIMIT", 1]]